<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>HasRemovalPasscode</key>
	<false/>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>EmailAccountDescription</key>
			<string>{{email}}</string>
			<key>EmailAccountName</key>
			<string>{{email}}</string>
			<key>EmailAccountType</key>
			<string>EmailTypeIMAP</string>
			<key>EmailAddress</key>
			<string>{{email}}</string>
			<key>IncomingMailServerAuthentication</key>
			<string>{% if imap.autentication == 'password-cleartext' %}EmailAuthPassword{% else %}EmailAuthNone{% endif %}</string>
			<key>IncomingMailServerHostName</key>
			<string>{{imap.host}}</string>
			<key>IncomingMailServerPortNumber</key>
			<integer>{{imap.port}}</integer>
			<key>IncomingMailServerUseSSL</key>
			{% if imap.ssl == 'on' %}<true/>{% else %}<false/>{% endif %}
			<key>IncomingMailServerUsername</key>
			<string>{{email}}</string>
			<key>OutgoingMailServerAuthentication</key>
			<string>EmailAuthPassword</string>
			<key>OutgoingMailServerHostName</key>
			<string>{{smtp.host}}</string>
			<key>OutgoingMailServerPortNumber</key>
			<integer>{{smtp.port}}</integer>
			<key>OutgoingMailServerUseSSL</key>
			{% if smtp.ssl == 'on' %}<true/>{% else %}<false/>{% endif %}
			<key>OutgoingMailServerUsername</key>
			<string>{{email}}</string>
			<key>OutgoingPasswordSameAsIncomingPassword</key>
			<true/>
			<key>PayloadDescription</key>
			<string>Configure Email Settings</string>
			<key>PayloadDisplayName</key>
			<string>{{email}}</string>
			<key>PayloadIdentifier</key>
			<string>{{payload_identifier}}</string>
			<key>PayloadType</key>
			<string>com.apple.mail.managed</string>
			<key>PayloadUUID</key>
			<string>{{payload_uuid}}</string>
			<key>PayloadVersion</key>
			<real>1</real>
			<key>SMIMEEnablePerMessageSwitch</key>
			<false/>
			<key>SMIMEEnabled</key>
			<false/>
			<key>disableMailRecentsSyncing</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Configure Email Settings</string>
	<key>PayloadDisplayName</key>
	<string>{{email}}</string>
	<key>PayloadIdentifier</key>
	<string>{{payload_identifier}}</string>
	<key>PayloadOrganization</key>
	<string>{{domain}}</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>{{payload_uuid}}</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
